#+title: LitLib Bash
#+author: mooss

#+property: header-args :wrap "src text :minipage"
#+property: header-args:bash+ :noweb no-export
#+options: ^:nil

*** Usage

This block will be used to illustrate =hereclude='s usage:
#+name: lost-numbers
#+begin_src text
4
8
15
16
23
42
#+end_src

This is how a Heredoc inclusion of the block above would look like (this is just for illustration purposes):
#+Call: hereclude("lost-numbers", "cat", "| sed 's|.*| -> &|' | nl -w1 -s ''")

#+RESULTS:
#+begin_src bash
cat <<aIvAUYsycFzabSvgDunG1631900104698751394 | sed 's|.*| -> &|' | nl -w1 -s ''
4
8
15
16
23
42
aIvAUYsycFzabSvgDunG1631900104698751394
#+end_src

The intended way to use =hereclude= is to call it directly inside a bash code block:

#+begin_src bash
echo Found the lost numbers:
<<hereclude("lost-numbers", "cat", "| sed 's|.*| -> &|' | nl -w1 -s ''")>>
#+end_src

#+RESULTS:
:results:
Found the lost numbers:
1 -> 4
2 -> 8
3 -> 15
4 -> 16
5 -> 23
6 -> 42
:end:

